Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.GetAttributeFile Method
Overload List
Name | Description
GetAttributeFile(String)
 Gets a file info representing the first match in the standard property file directories.
GetAttributeFile(List<String>, String) |  Obsolete.
 Gets a file info representing the first match in the search directories.
Top
See Also
Reference
EnvironmentFiles Class
Tekla.Structures.Dialog.UIControls Namespace